{
  "nodes": [
    {
      "op": "null", 
      "name": "timeFeaturesPred", 
      "inputs": []
    }, 
    {
      "op": "SliceChannel", 
      "name": "dec_input_seq", 
      "attrs": {
        "axis": "2", 
        "num_outputs": "7", 
        "squeeze_axis": "True"
      }, 
      "inputs": [[0, 0, 0]]
    }, 
    {
      "op": "repeat", 
      "name": "repeat1128", 
      "attrs": {
        "axis": "0", 
        "repeats": "100"
      }, 
      "inputs": [[1, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "itemFeatures", 
      "inputs": []
    }, 
    {
      "op": "SliceChannel", 
      "name": "item_features_categorical_seq", 
      "attrs": {
        "axis": "1", 
        "num_outputs": "1", 
        "squeeze_axis": "True"
      }, 
      "inputs": [[3, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "embed_0_weight", 
      "inputs": []
    }, 
    {
      "op": "Embedding", 
      "name": "item_embed_0", 
      "attrs": {
        "input_dim": "1", 
        "output_dim": "10"
      }, 
      "inputs": [[4, 0, 0], [5, 0, 0]]
    }, 
    {
      "op": "Concat", 
      "name": "item_inputs_embed", 
      "attrs": {
        "dim": "1", 
        "num_args": "1"
      }, 
      "inputs": [[6, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "trainTarget", 
      "inputs": []
    }, 
    {
      "op": "expand_dims", 
      "name": "expand_dims6", 
      "attrs": {"axis": "2"}, 
      "inputs": [[8, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "trainTarget_seq", 
      "attrs": {
        "axis": "1", 
        "num_outputs": "1123", 
        "squeeze_axis": "True"
      }, 
      "inputs": [[9, 0, 0]]
    }, 
    {
      "op": "Concat", 
      "name": "concat80", 
      "attrs": {
        "dim": "1", 
        "num_args": "30"
      }, 
      "inputs": [
        [10, 1093, 0], 
        [10, 1094, 0], 
        [10, 1095, 0], 
        [10, 1096, 0], 
        [10, 1097, 0], 
        [10, 1098, 0], 
        [10, 1099, 0], 
        [10, 1100, 0], 
        [10, 1101, 0], 
        [10, 1102, 0], 
        [10, 1103, 0], 
        [10, 1104, 0], 
        [10, 1105, 0], 
        [10, 1106, 0], 
        [10, 1107, 0], 
        [10, 1108, 0], 
        [10, 1109, 0], 
        [10, 1110, 0], 
        [10, 1111, 0], 
        [10, 1112, 0], 
        [10, 1113, 0], 
        [10, 1114, 0], 
        [10, 1115, 0], 
        [10, 1116, 0], 
        [10, 1117, 0], 
        [10, 1118, 0], 
        [10, 1119, 0], 
        [10, 1120, 0], 
        [10, 1121, 0], 
        [10, 1122, 0]
      ]
    }, 
    {
      "op": "abs", 
      "name": "abs1", 
      "inputs": [[11, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "observedValuesTrain", 
      "inputs": []
    }, 
    {
      "op": "expand_dims", 
      "name": "expand_dims9", 
      "attrs": {"axis": "2"}, 
      "inputs": [[13, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "observedValuesTrain_seq", 
      "attrs": {
        "axis": "1", 
        "num_outputs": "1123", 
        "squeeze_axis": "True"
      }, 
      "inputs": [[14, 0, 0]]
    }, 
    {
      "op": "Concat", 
      "name": "concat81", 
      "attrs": {
        "dim": "1", 
        "num_args": "30"
      }, 
      "inputs": [
        [15, 1093, 0], 
        [15, 1094, 0], 
        [15, 1095, 0], 
        [15, 1096, 0], 
        [15, 1097, 0], 
        [15, 1098, 0], 
        [15, 1099, 0], 
        [15, 1100, 0], 
        [15, 1101, 0], 
        [15, 1102, 0], 
        [15, 1103, 0], 
        [15, 1104, 0], 
        [15, 1105, 0], 
        [15, 1106, 0], 
        [15, 1107, 0], 
        [15, 1108, 0], 
        [15, 1109, 0], 
        [15, 1110, 0], 
        [15, 1111, 0], 
        [15, 1112, 0], 
        [15, 1113, 0], 
        [15, 1114, 0], 
        [15, 1115, 0], 
        [15, 1116, 0], 
        [15, 1117, 0], 
        [15, 1118, 0], 
        [15, 1119, 0], 
        [15, 1120, 0], 
        [15, 1121, 0], 
        [15, 1122, 0]
      ]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "_mul563", 
      "inputs": [[12, 0, 0], [16, 0, 0]]
    }, 
    {
      "op": "sum", 
      "name": "sum3", 
      "attrs": {"axis": "1"}, 
      "inputs": [[17, 0, 0]]
    }, 
    {
      "op": "sum", 
      "name": "sum2", 
      "attrs": {"axis": "1"}, 
      "inputs": [[16, 0, 0]]
    }, 
    {
      "op": "zeros_like", 
      "name": "zeros_like105", 
      "inputs": [[19, 0, 0]]
    }, 
    {
      "op": "broadcast_greater", 
      "name": "broadcast_greater1", 
      "inputs": [[18, 0, 0], [20, 0, 0]]
    }, 
    {
      "op": "ones_like", 
      "name": "ones_like150", 
      "inputs": [[19, 0, 0]]
    }, 
    {
      "op": "broadcast_maximum", 
      "name": "broadcast_maximum1", 
      "inputs": [[19, 0, 0], [22, 0, 0]]
    }, 
    {
      "op": "broadcast_div", 
      "name": "broadcast_div38", 
      "inputs": [[18, 0, 0], [23, 0, 0]]
    }, 
    {
      "op": "ones_like", 
      "name": "ones_like151", 
      "inputs": [[24, 0, 0]]
    }, 
    {
      "op": "_mul_scalar", 
      "name": "_mulscalar112", 
      "attrs": {"scalar": "68.92399389757499"}, 
      "inputs": [[25, 0, 0]]
    }, 
    {
      "op": "where", 
      "name": "where336", 
      "inputs": [[21, 0, 0], [24, 0, 0], [26, 0, 0]]
    }, 
    {
      "op": "_maximum_scalar", 
      "name": "_maximumscalar1", 
      "attrs": {"scalar": "1e-10"}, 
      "inputs": [[27, 0, 0]]
    }, 
    {
      "op": "Reshape", 
      "name": "reshape1", 
      "attrs": {"shape": "(-1,)"}, 
      "inputs": [[28, 0, 0]]
    }, 
    {
      "op": "expand_dims", 
      "name": "expand_dims11", 
      "attrs": {"axis": "1"}, 
      "inputs": [[29, 0, 0]]
    }, 
    {
      "op": "log", 
      "name": "log75", 
      "inputs": [[30, 0, 0]]
    }, 
    {
      "op": "Concat", 
      "name": "concat82", 
      "attrs": {
        "dim": "1", 
        "num_args": "2"
      }, 
      "inputs": [[7, 0, 0], [31, 0, 0]]
    }, 
    {
      "op": "repeat", 
      "name": "repeat1129", 
      "attrs": {
        "axis": "0", 
        "repeats": "100"
      }, 
      "inputs": [[32, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "isPaddedTrain", 
      "inputs": []
    }, 
    {
      "op": "expand_dims", 
      "name": "expand_dims8", 
      "attrs": {"axis": "2"}, 
      "inputs": [[34, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "isPaddedTrain_seq", 
      "attrs": {
        "axis": "1", 
        "num_outputs": "1123", 
        "squeeze_axis": "True"
      }, 
      "inputs": [[35, 0, 0]]
    }, 
    {
      "op": "zeros_like", 
      "name": "zeros_like195", 
      "inputs": [[10, 1122, 0]]
    }, 
    {
      "op": "null", 
      "name": "timeFeaturesTrain", 
      "inputs": []
    }, 
    {
      "op": "SliceChannel", 
      "name": "enc_input_seq", 
      "attrs": {
        "axis": "2", 
        "num_outputs": "1123", 
        "squeeze_axis": "True"
      }, 
      "inputs": [[38, 0, 0]]
    }, 
    {
      "op": "zeros_like", 
      "name": "zeros_like192", 
      "inputs": [[10, 1121, 0]]
    }, 
    {
      "op": "zeros_like", 
      "name": "zeros_like189", 
      "inputs": [[10, 1120, 0]]
    }, 
    {
      "op": "zeros_like", 
      "name": "zeros_like186", 
      "inputs": [[10, 1119, 0]]
    }, 
    {
      "op": "zeros_like", 
      "name": "zeros_like183", 
      "inputs": [[10, 1118, 0]]
    }, 
    {
      "op": "zeros_like", 
      "name": "zeros_like180", 
      "inputs": [[10, 1117, 0]]
    }, 
    {
      "op": "zeros_like", 
      "name": "zeros_like177", 
      "inputs": [[10, 1116, 0]]
    }, 
    {
      "op": "zeros_like", 
      "name": "zeros_like174", 
      "inputs": [[10, 1115, 0]]
    }, 
    {
      "op": "zeros_like", 
      "name": "zeros_like171", 
      "inputs": [[10, 1114, 0]]
    }, 
    {
      "op": "zeros_like", 
      "name": "zeros_like168", 
      "inputs": [[10, 1113, 0]]
    }, 
    {
      "op": "zeros_like", 
      "name": "zeros_like165", 
      "inputs": [[10, 1112, 0]]
    }, 
    {
      "op": "zeros_like", 
      "name": "zeros_like162", 
      "inputs": [[10, 1111, 0]]
    }, 
    {
      "op": "zeros_like", 
      "name": "zeros_like159", 
      "inputs": [[10, 1110, 0]]
    }, 
    {
      "op": "zeros_like", 
      "name": "zeros_like156", 
      "inputs": [[10, 1109, 0]]
    }, 
    {
      "op": "zeros_like", 
      "name": "zeros_like153", 
      "inputs": [[10, 1108, 0]]
    }, 
    {
      "op": "zeros_like", 
      "name": "zeros_like150", 
      "inputs": [[10, 1107, 0]]
    }, 
    {
      "op": "zeros_like", 
      "name": "zeros_like147", 
      "inputs": [[10, 1106, 0]]
    }, 
    {
      "op": "zeros_like", 
      "name": "zeros_like144", 
      "inputs": [[10, 1105, 0]]
    }, 
    {
      "op": "zeros_like", 
      "name": "zeros_like141", 
      "inputs": [[10, 1104, 0]]
    }, 
    {
      "op": "zeros_like", 
      "name": "zeros_like138", 
      "inputs": [[10, 1103, 0]]
    }, 
    {
      "op": "zeros_like", 
      "name": "zeros_like135", 
      "inputs": [[10, 1102, 0]]
    }, 
    {
      "op": "zeros_like", 
      "name": "zeros_like132", 
      "inputs": [[10, 1101, 0]]
    }, 
    {
      "op": "zeros_like", 
      "name": "zeros_like129", 
      "inputs": [[10, 1100, 0]]
    }, 
    {
      "op": "zeros_like", 
      "name": "zeros_like126", 
      "inputs": [[10, 1099, 0]]
    }, 
    {
      "op": "zeros_like", 
      "name": "zeros_like123", 
      "inputs": [[10, 1098, 0]]
    }, 
    {
      "op": "zeros_like", 
      "name": "zeros_like120", 
      "inputs": [[10, 1097, 0]]
    }, 
    {
      "op": "zeros_like", 
      "name": "zeros_like117", 
      "inputs": [[10, 1096, 0]]
    }, 
    {
      "op": "zeros_like", 
      "name": "zeros_like114", 
      "inputs": [[10, 1095, 0]]
    }, 
    {
      "op": "zeros_like", 
      "name": "zeros_like111", 
      "inputs": [[10, 1094, 0]]
    }, 
    {
      "op": "zeros_like", 
      "name": "zeros_like108", 
      "inputs": [[10, 1093, 0]]
    }, 
    {
      "op": "Concat", 
      "name": "concat83", 
      "attrs": {
        "dim": "1", 
        "num_args": "30"
      }, 
      "inputs": [
        [10, 1092, 0], 
        [10, 1091, 0], 
        [10, 1090, 0], 
        [10, 1089, 0], 
        [10, 1088, 0], 
        [10, 1087, 0], 
        [10, 1086, 0], 
        [10, 1085, 0], 
        [10, 1080, 0], 
        [10, 1079, 0], 
        [10, 1078, 0], 
        [10, 1073, 0], 
        [10, 1072, 0], 
        [10, 1071, 0], 
        [10, 1066, 0], 
        [10, 1065, 0], 
        [10, 1064, 0], 
        [10, 1063, 0], 
        [10, 1062, 0], 
        [10, 1037, 0], 
        [10, 1009, 0], 
        [10, 730, 0], 
        [10, 729, 0], 
        [10, 728, 0], 
        [10, 366, 0], 
        [10, 365, 0], 
        [10, 364, 0], 
        [10, 2, 0], 
        [10, 1, 0], 
        [10, 0, 0]
      ]
    }, 
    {
      "op": "broadcast_div", 
      "name": "broadcast_div39", 
      "inputs": [[69, 0, 0], [30, 0, 0]]
    }, 
    {
      "op": "Concat", 
      "name": "concat84", 
      "attrs": {
        "dim": "1", 
        "num_args": "3"
      }, 
      "inputs": [[39, 1093, 0], [32, 0, 0], [70, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "lstm_l_0i2h_weight", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "lstm_l_0i2h_bias", 
      "attrs": {"__init__": "[\"lstmbias\", {\"forget_bias\": 1.0}]"}, 
      "inputs": []
    }, 
    {
      "op": "FullyConnected", 
      "name": "lstm_l_0t0_i2h", 
      "attrs": {"num_hidden": "160"}, 
      "inputs": [[71, 0, 0], [72, 0, 0], [73, 0, 0]]
    }, 
    {
      "op": "_zeros", 
      "name": "lstm_l_0begin_state_0", 
      "attrs": {
        "__layout__": "NC", 
        "dtype": "float32", 
        "shape": "(0, 40)"
      }, 
      "inputs": []
    }, 
    {
      "op": "where", 
      "name": "where337", 
      "inputs": [[36, 1093, 0], [75, 0, 0], [75, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "lstm_l_0h2h_weight", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "lstm_l_0h2h_bias", 
      "inputs": []
    }, 
    {
      "op": "FullyConnected", 
      "name": "lstm_l_0t0_h2h", 
      "attrs": {"num_hidden": "160"}, 
      "inputs": [[76, 0, 0], [77, 0, 0], [78, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus148", 
      "inputs": [[74, 0, 0], [79, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "lstm_l_0t0_slice", 
      "attrs": {"num_outputs": "4"}, 
      "inputs": [[80, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "lstm_l_0t0_o", 
      "attrs": {"act_type": "sigmoid"}, 
      "inputs": [[81, 3, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "lstm_l_0t0_f", 
      "attrs": {"act_type": "sigmoid"}, 
      "inputs": [[81, 1, 0]]
    }, 
    {
      "op": "_zeros", 
      "name": "lstm_l_0begin_state_1", 
      "attrs": {
        "__layout__": "NC", 
        "dtype": "float32", 
        "shape": "(0, 40)"
      }, 
      "inputs": []
    }, 
    {
      "op": "where", 
      "name": "where338", 
      "inputs": [[36, 1093, 0], [84, 0, 0], [84, 0, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "_mul564", 
      "inputs": [[83, 0, 0], [85, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "lstm_l_0t0_i", 
      "attrs": {"act_type": "sigmoid"}, 
      "inputs": [[81, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "lstm_l_0t0_c", 
      "attrs": {"act_type": "tanh"}, 
      "inputs": [[81, 2, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "_mul565", 
      "inputs": [[87, 0, 0], [88, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "lstm_l_0t0_state", 
      "inputs": [[86, 0, 0], [89, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation148", 
      "attrs": {"act_type": "tanh"}, 
      "inputs": [[90, 0, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "lstm_l_0t0_out", 
      "inputs": [[82, 0, 0], [91, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "lstm_l_1i2h_weight", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "lstm_l_1i2h_bias", 
      "attrs": {"__init__": "[\"lstmbias\", {\"forget_bias\": 1.0}]"}, 
      "inputs": []
    }, 
    {
      "op": "FullyConnected", 
      "name": "lstm_l_1t0_i2h", 
      "attrs": {"num_hidden": "160"}, 
      "inputs": [[92, 0, 0], [93, 0, 0], [94, 0, 0]]
    }, 
    {
      "op": "_zeros", 
      "name": "lstm_l_1begin_state_0", 
      "attrs": {
        "__layout__": "NC", 
        "dtype": "float32", 
        "shape": "(0, 40)"
      }, 
      "inputs": []
    }, 
    {
      "op": "where", 
      "name": "where339", 
      "inputs": [[36, 1093, 0], [96, 0, 0], [96, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "lstm_l_1h2h_weight", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "lstm_l_1h2h_bias", 
      "inputs": []
    }, 
    {
      "op": "FullyConnected", 
      "name": "lstm_l_1t0_h2h", 
      "attrs": {"num_hidden": "160"}, 
      "inputs": [[97, 0, 0], [98, 0, 0], [99, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus149", 
      "inputs": [[95, 0, 0], [100, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "lstm_l_1t0_slice", 
      "attrs": {"num_outputs": "4"}, 
      "inputs": [[101, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "lstm_l_1t0_o", 
      "attrs": {"act_type": "sigmoid"}, 
      "inputs": [[102, 3, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "lstm_l_1t0_f", 
      "attrs": {"act_type": "sigmoid"}, 
      "inputs": [[102, 1, 0]]
    }, 
    {
      "op": "_zeros", 
      "name": "lstm_l_1begin_state_1", 
      "attrs": {
        "__layout__": "NC", 
        "dtype": "float32", 
        "shape": "(0, 40)"
      }, 
      "inputs": []
    }, 
    {
      "op": "where", 
      "name": "where340", 
      "inputs": [[36, 1093, 0], [105, 0, 0], [105, 0, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "_mul566", 
      "inputs": [[104, 0, 0], [106, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "lstm_l_1t0_i", 
      "attrs": {"act_type": "sigmoid"}, 
      "inputs": [[102, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "lstm_l_1t0_c", 
      "attrs": {"act_type": "tanh"}, 
      "inputs": [[102, 2, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "_mul567", 
      "inputs": [[108, 0, 0], [109, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "lstm_l_1t0_state", 
      "inputs": [[107, 0, 0], [110, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation149", 
      "attrs": {"act_type": "tanh"}, 
      "inputs": [[111, 0, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "lstm_l_1t0_out", 
      "inputs": [[103, 0, 0], [112, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "lstm_l_1t0_out_plus_residual", 
      "inputs": [[113, 0, 0], [92, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "mu_Noneproj_weight", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "mu_Noneproj_bias", 
      "inputs": []
    }, 
    {
      "op": "FullyConnected", 
      "name": "fullyconnected111", 
      "attrs": {"num_hidden": "1"}, 
      "inputs": [[114, 0, 0], [115, 0, 0], [116, 0, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "_mul574", 
      "inputs": [[117, 0, 0], [30, 0, 0]]
    }, 
    {
      "op": "where", 
      "name": "where345", 
      "inputs": [[36, 1093, 0], [68, 0, 0], [118, 0, 0]]
    }, 
    {
      "op": "where", 
      "name": "where346", 
      "inputs": [[15, 1093, 0], [10, 1093, 0], [119, 0, 0]]
    }, 
    {
      "op": "Concat", 
      "name": "concat85", 
      "attrs": {
        "dim": "1", 
        "num_args": "30"
      }, 
      "inputs": [
        [120, 0, 0], 
        [10, 1092, 0], 
        [10, 1091, 0], 
        [10, 1090, 0], 
        [10, 1089, 0], 
        [10, 1088, 0], 
        [10, 1087, 0], 
        [10, 1086, 0], 
        [10, 1081, 0], 
        [10, 1080, 0], 
        [10, 1079, 0], 
        [10, 1074, 0], 
        [10, 1073, 0], 
        [10, 1072, 0], 
        [10, 1067, 0], 
        [10, 1066, 0], 
        [10, 1065, 0], 
        [10, 1064, 0], 
        [10, 1063, 0], 
        [10, 1038, 0], 
        [10, 1010, 0], 
        [10, 731, 0], 
        [10, 730, 0], 
        [10, 729, 0], 
        [10, 367, 0], 
        [10, 366, 0], 
        [10, 365, 0], 
        [10, 3, 0], 
        [10, 2, 0], 
        [10, 1, 0]
      ]
    }, 
    {
      "op": "broadcast_div", 
      "name": "broadcast_div40", 
      "inputs": [[121, 0, 0], [30, 0, 0]]
    }, 
    {
      "op": "Concat", 
      "name": "concat86", 
      "attrs": {
        "dim": "1", 
        "num_args": "3"
      }, 
      "inputs": [[39, 1094, 0], [32, 0, 0], [122, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "lstm_l_0t1_i2h", 
      "attrs": {"num_hidden": "160"}, 
      "inputs": [[123, 0, 0], [72, 0, 0], [73, 0, 0]]
    }, 
    {
      "op": "ones_like", 
      "name": "ones_like152", 
      "inputs": [[92, 0, 0]]
    }, 
    {
      "op": "Dropout", 
      "name": "dropout148", 
      "attrs": {"p": "0.1"}, 
      "inputs": [[125, 0, 0]]
    }, 
    {
      "op": "where", 
      "name": "where341", 
      "inputs": [[126, 0, 0], [92, 0, 0], [76, 0, 0]]
    }, 
    {
      "op": "where", 
      "name": "where347", 
      "inputs": [[36, 1094, 0], [75, 0, 0], [127, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "lstm_l_0t1_h2h", 
      "attrs": {"num_hidden": "160"}, 
      "inputs": [[128, 0, 0], [77, 0, 0], [78, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus152", 
      "inputs": [[124, 0, 0], [129, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "lstm_l_0t1_slice", 
      "attrs": {"num_outputs": "4"}, 
      "inputs": [[130, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "lstm_l_0t1_o", 
      "attrs": {"act_type": "sigmoid"}, 
      "inputs": [[131, 3, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "lstm_l_0t1_f", 
      "attrs": {"act_type": "sigmoid"}, 
      "inputs": [[131, 1, 0]]
    }, 
    {
      "op": "ones_like", 
      "name": "ones_like153", 
      "inputs": [[90, 0, 0]]
    }, 
    {
      "op": "Dropout", 
      "name": "dropout149", 
      "attrs": {"p": "0.1"}, 
      "inputs": [[134, 0, 0]]
    }, 
    {
      "op": "where", 
      "name": "where342", 
      "inputs": [[135, 0, 0], [90, 0, 0], [85, 0, 0]]
    }, 
    {
      "op": "where", 
      "name": "where348", 
      "inputs": [[36, 1094, 0], [84, 0, 0], [136, 0, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "_mul579", 
      "inputs": [[133, 0, 0], [137, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "lstm_l_0t1_i", 
      "attrs": {"act_type": "sigmoid"}, 
      "inputs": [[131, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "lstm_l_0t1_c", 
      "attrs": {"act_type": "tanh"}, 
      "inputs": [[131, 2, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "_mul580", 
      "inputs": [[139, 0, 0], [140, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "lstm_l_0t1_state", 
      "inputs": [[138, 0, 0], [141, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation152", 
      "attrs": {"act_type": "tanh"}, 
      "inputs": [[142, 0, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "lstm_l_0t1_out", 
      "inputs": [[132, 0, 0], [143, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "lstm_l_1t1_i2h", 
      "attrs": {"num_hidden": "160"}, 
      "inputs": [[144, 0, 0], [93, 0, 0], [94, 0, 0]]
    }, 
    {
      "op": "ones_like", 
      "name": "ones_like154", 
      "inputs": [[113, 0, 0]]
    }, 
    {
      "op": "Dropout", 
      "name": "dropout150", 
      "attrs": {"p": "0.1"}, 
      "inputs": [[146, 0, 0]]
    }, 
    {
      "op": "where", 
      "name": "where343", 
      "inputs": [[147, 0, 0], [113, 0, 0], [97, 0, 0]]
    }, 
    {
      "op": "where", 
      "name": "where349", 
      "inputs": [[36, 1094, 0], [96, 0, 0], [148, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "lstm_l_1t1_h2h", 
      "attrs": {"num_hidden": "160"}, 
      "inputs": [[149, 0, 0], [98, 0, 0], [99, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus153", 
      "inputs": [[145, 0, 0], [150, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "lstm_l_1t1_slice", 
      "attrs": {"num_outputs": "4"}, 
      "inputs": [[151, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "lstm_l_1t1_o", 
      "attrs": {"act_type": "sigmoid"}, 
      "inputs": [[152, 3, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "lstm_l_1t1_f", 
      "attrs": {"act_type": "sigmoid"}, 
      "inputs": [[152, 1, 0]]
    }, 
    {
      "op": "ones_like", 
      "name": "ones_like155", 
      "inputs": [[111, 0, 0]]
    }, 
    {
      "op": "Dropout", 
      "name": "dropout151", 
      "attrs": {"p": "0.1"}, 
      "inputs": [[155, 0, 0]]
    }, 
    {
      "op": "where", 
      "name": "where344", 
      "inputs": [[156, 0, 0], [111, 0, 0], [106, 0, 0]]
    }, 
    {
      "op": "where", 
      "name": "where350", 
      "inputs": [[36, 1094, 0], [105, 0, 0], [157, 0, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "_mul581", 
      "inputs": [[154, 0, 0], [158, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "lstm_l_1t1_i", 
      "attrs": {"act_type": "sigmoid"}, 
      "inputs": [[152, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "lstm_l_1t1_c", 
      "attrs": {"act_type": "tanh"}, 
      "inputs": [[152, 2, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "_mul582", 
      "inputs": [[160, 0, 0], [161, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "lstm_l_1t1_state", 
      "inputs": [[159, 0, 0], [162, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation153", 
      "attrs": {"act_type": "tanh"}, 
      "inputs": [[163, 0, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "lstm_l_1t1_out", 
      "inputs": [[153, 0, 0], [164, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "lstm_l_1t1_out_plus_residual", 
      "inputs": [[165, 0, 0], [144, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "fullyconnected114", 
      "attrs": {"num_hidden": "1"}, 
      "inputs": [[166, 0, 0], [115, 0, 0], [116, 0, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "_mul589", 
      "inputs": [[167, 0, 0], [30, 0, 0]]
    }, 
    {
      "op": "where", 
      "name": "where355", 
      "inputs": [[36, 1094, 0], [67, 0, 0], [168, 0, 0]]
    }, 
    {
      "op": "where", 
      "name": "where356", 
      "inputs": [[15, 1094, 0], [10, 1094, 0], [169, 0, 0]]
    }, 
    {
      "op": "Concat", 
      "name": "concat87", 
      "attrs": {
        "dim": "1", 
        "num_args": "30"
      }, 
      "inputs": [
        [170, 0, 0], 
        [120, 0, 0], 
        [10, 1092, 0], 
        [10, 1091, 0], 
        [10, 1090, 0], 
        [10, 1089, 0], 
        [10, 1088, 0], 
        [10, 1087, 0], 
        [10, 1082, 0], 
        [10, 1081, 0], 
        [10, 1080, 0], 
        [10, 1075, 0], 
        [10, 1074, 0], 
        [10, 1073, 0], 
        [10, 1068, 0], 
        [10, 1067, 0], 
        [10, 1066, 0], 
        [10, 1065, 0], 
        [10, 1064, 0], 
        [10, 1039, 0], 
        [10, 1011, 0], 
        [10, 732, 0], 
        [10, 731, 0], 
        [10, 730, 0], 
        [10, 368, 0], 
        [10, 367, 0], 
        [10, 366, 0], 
        [10, 4, 0], 
        [10, 3, 0], 
        [10, 2, 0]
      ]
    }, 
    {
      "op": "broadcast_div", 
      "name": "broadcast_div41", 
      "inputs": [[171, 0, 0], [30, 0, 0]]
    }, 
    {
      "op": "Concat", 
      "name": "concat88", 
      "attrs": {
        "dim": "1", 
        "num_args": "3"
      }, 
      "inputs": [[39, 1095, 0], [32, 0, 0], [172, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "lstm_l_0t2_i2h", 
      "attrs": {"num_hidden": "160"}, 
      "inputs": [[173, 0, 0], [72, 0, 0], [73, 0, 0]]
    }, 
    {
      "op": "ones_like", 
      "name": "ones_like156", 
      "inputs": [[144, 0, 0]]
    }, 
    {
      "op": "Dropout", 
      "name": "dropout152", 
      "attrs": {"p": "0.1"}, 
      "inputs": [[175, 0, 0]]
    }, 
    {
      "op": "where", 
      "name": "where351", 
      "inputs": [[176, 0, 0], [144, 0, 0], [128, 0, 0]]
    }, 
    {
      "op": "where", 
      "name": "where357", 
      "inputs": [[36, 1095, 0], [75, 0, 0], [177, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "lstm_l_0t2_h2h", 
      "attrs": {"num_hidden": "160"}, 
      "inputs": [[178, 0, 0], [77, 0, 0], [78, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus156", 
      "inputs": [[174, 0, 0], [179, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "lstm_l_0t2_slice", 
      "attrs": {"num_outputs": "4"}, 
      "inputs": [[180, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "lstm_l_0t2_o", 
      "attrs": {"act_type": "sigmoid"}, 
      "inputs": [[181, 3, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "lstm_l_0t2_f", 
      "attrs": {"act_type": "sigmoid"}, 
      "inputs": [[181, 1, 0]]
    }, 
    {
      "op": "ones_like", 
      "name": "ones_like157", 
      "inputs": [[142, 0, 0]]
    }, 
    {
      "op": "Dropout", 
      "name": "dropout153", 
      "attrs": {"p": "0.1"}, 
      "inputs": [[184, 0, 0]]
    }, 
    {
      "op": "where", 
      "name": "where352", 
      "inputs": [[185, 0, 0], [142, 0, 0], [137, 0, 0]]
    }, 
    {
      "op": "where", 
      "name": "where358", 
      "inputs": [[36, 1095, 0], [84, 0, 0], [186, 0, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "_mul594", 
      "inputs": [[183, 0, 0], [187, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "lstm_l_0t2_i", 
      "attrs": {"act_type": "sigmoid"}, 
      "inputs": [[181, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "lstm_l_0t2_c", 
      "attrs": {"act_type": "tanh"}, 
      "inputs": [[181, 2, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "_mul595", 
      "inputs": [[189, 0, 0], [190, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "lstm_l_0t2_state", 
      "inputs": [[188, 0, 0], [191, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation156", 
      "attrs": {"act_type": "tanh"}, 
      "inputs": [[192, 0, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "lstm_l_0t2_out", 
      "inputs": [[182, 0, 0], [193, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "lstm_l_1t2_i2h", 
      "attrs": {"num_hidden": "160"}, 
      "inputs": [[194, 0, 0], [93, 0, 0], [94, 0, 0]]
    }, 
    {
      "op": "ones_like", 
      "name": "ones_like158", 
      "inputs": [[165, 0, 0]]
    }, 
    {
      "op": "Dropout", 
      "name": "dropout154", 
      "attrs": {"p": "0.1"}, 
      "inputs": [[196, 0, 0]]
    }, 
    {
      "op": "where", 
      "name": "where353", 
      "inputs": [[197, 0, 0], [165, 0, 0], [149, 0, 0]]
    }, 
    {
      "op": "where", 
      "name": "where359", 
      "inputs": [[36, 1095, 0], [96, 0, 0], [198, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "lstm_l_1t2_h2h", 
      "attrs": {"num_hidden": "160"}, 
      "inputs": [[199, 0, 0], [98, 0, 0], [99, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus157", 
      "inputs": [[195, 0, 0], [200, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "lstm_l_1t2_slice", 
      "attrs": {"num_outputs": "4"}, 
      "inputs": [[201, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "lstm_l_1t2_o", 
      "attrs": {"act_type": "sigmoid"}, 
      "inputs": [[202, 3, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "lstm_l_1t2_f", 
      "attrs": {"act_type": "sigmoid"}, 
      "inputs": [[202, 1, 0]]
    }, 
    {
      "op": "ones_like", 
      "name": "ones_like159", 
      "inputs": [[163, 0, 0]]
    }, 
    {
      "op": "Dropout", 
      "name": "dropout155", 
      "attrs": {"p": "0.1"}, 
      "inputs": [[205, 0, 0]]
    }, 
    {
      "op": "where", 
      "name": "where354", 
      "inputs": [[206, 0, 0], [163, 0, 0], [158, 0, 0]]
    }, 
    {
      "op": "where", 
      "name": "where360", 
      "inputs": [[36, 1095, 0], [105, 0, 0], [207, 0, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "_mul596", 
      "inputs": [[204, 0, 0], [208, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "lstm_l_1t2_i", 
      "attrs": {"act_type": "sigmoid"}, 
      "inputs": [[202, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "lstm_l_1t2_c", 
      "attrs": {"act_type": "tanh"}, 
      "inputs": [[202, 2, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "_mul597", 
      "inputs": [[210, 0, 0], [211, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "lstm_l_1t2_state", 
      "inputs": [[209, 0, 0], [212, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation157", 
      "attrs": {"act_type": "tanh"}, 
      "inputs": [[213, 0, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "lstm_l_1t2_out", 
      "inputs": [[203, 0, 0], [214, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "lstm_l_1t2_out_plus_residual", 
      "inputs": [[215, 0, 0], [194, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "fullyconnected117", 
      "attrs": {"num_hidden": "1"}, 
      "inputs": [[216, 0, 0], [115, 0, 0], [116, 0, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "_mul604", 
      "inputs": [[217, 0, 0], [30, 0, 0]]
    }, 
    {
      "op": "where", 
      "name": "where365", 
      "inputs": [[36, 1095, 0], [66, 0, 0], [218, 0, 0]]
    }, 
    {
      "op": "where", 
      "name": "where366", 
      "inputs": [[15, 1095, 0], [10, 1095, 0], [219, 0, 0]]
    }, 
    {
      "op": "Concat", 
      "name": "concat89", 
      "attrs": {
        "dim": "1", 
        "num_args": "30"
      }, 
      "inputs": [
        [220, 0, 0], 
        [170, 0, 0], 
        [120, 0, 0], 
        [10, 1092, 0], 
        [10, 1091, 0], 
        [10, 1090, 0], 
        [10, 1089, 0], 
        [10, 1088, 0], 
        [10, 1083, 0], 
        [10, 1082, 0], 
        [10, 1081, 0], 
        [10, 1076, 0], 
        [10, 1075, 0], 
        [10, 1074, 0], 
        [10, 1069, 0], 
        [10, 1068, 0], 
        [10, 1067, 0], 
        [10, 1066, 0], 
        [10, 1065, 0], 
        [10, 1040, 0], 
        [10, 1012, 0], 
        [10, 733, 0], 
        [10, 732, 0], 
        [10, 731, 0], 
        [10, 369, 0], 
        [10, 368, 0], 
        [10, 367, 0], 
        [10, 5, 0], 
        [10, 4, 0], 
        [10, 3, 0]
      ]
    }, 
    {
      "op": "broadcast_div", 
      "name": "broadcast_div42", 
      "inputs": [[221, 0, 0], [30, 0, 0]]
    }, 
    {
      "op": "Concat", 
      "name": "concat90", 
      "attrs": {
        "dim": "1", 
        "num_args": "3"
      }, 
      "inputs": [[39, 1096, 0], [32, 0, 0], [222, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "lstm_l_0t3_i2h", 
      "attrs": {"num_hidden": "160"}, 
      "inputs": [[223, 0, 0], [72, 0, 0], [73, 0, 0]]
    }, 
    {
      "op": "ones_like", 
      "name": "ones_like160", 
      "inputs": [[194, 0, 0]]
    }, 
    {
      "op": "Dropout", 
      "name": "dropout156", 
      "attrs": {"p": "0.1"}, 
      "inputs": [[225, 0, 0]]
    }, 
    {
      "op": "where", 
      "name": "where361", 
      "inputs": [[226, 0, 0], [194, 0, 0], [178, 0, 0]]
    }, 
    {
      "op": "where", 
      "name": "where367", 
      "inputs": [[36, 1096, 0], [75, 0, 0], [227, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "lstm_l_0t3_h2h", 
      "attrs": {"num_hidden": "160"}, 
      "inputs": [[228, 0, 0], [77, 0, 0], [78, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus160", 
      "inputs": [[224, 0, 0], [229, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "lstm_l_0t3_slice", 
      "attrs": {"num_outputs": "4"}, 
      "inputs": [[230, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "lstm_l_0t3_o", 
      "attrs": {"act_type": "sigmoid"}, 
      "inputs": [[231, 3, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "lstm_l_0t3_f", 
      "attrs": {"act_type": "sigmoid"}, 
      "inputs": [[231, 1, 0]]
    }, 
    {
      "op": "ones_like", 
      "name": "ones_like161", 
      "inputs": [[192, 0, 0]]
    }, 
    {
      "op": "Dropout", 
      "name": "dropout157", 
      "attrs": {"p": "0.1"}, 
      "inputs": [[234, 0, 0]]
    }, 
    {
      "op": "where", 
      "name": "where362", 
      "inputs": [[235, 0, 0], [192, 0, 0], [187, 0, 0]]
    }, 
    {
      "op": "where", 
      "name": "where368", 
      "inputs": [[36, 1096, 0], [84, 0, 0], [236, 0, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "_mul609", 
      "inputs": [[233, 0, 0], [237, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "lstm_l_0t3_i", 
      "attrs": {"act_type": "sigmoid"}, 
      "inputs": [[231, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "lstm_l_0t3_c", 
      "attrs": {"act_type": "tanh"}, 
      "inputs": [[231, 2, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "_mul610", 
      "inputs": [[239, 0, 0], [240, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "lstm_l_0t3_state", 
      "inputs": [[238, 0, 0], [241, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation160", 
      "attrs": {"act_type": "tanh"}, 
      "inputs": [[242, 0, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "lstm_l_0t3_out", 
      "inputs": [[232, 0, 0], [243, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "lstm_l_1t3_i2h", 
      "attrs": {"num_hidden": "160"}, 
      "inputs": [[244, 0, 0], [93, 0, 0], [94, 0, 0]]
    }, 
    {
      "op": "ones_like", 
      "name": "ones_like162", 
      "inputs": [[215, 0, 0]]
    }, 
    {
      "op": "Dropout", 
      "name": "dropout158", 
      "attrs": {"p": "0.1"}, 
      "inputs": [[246, 0, 0]]
    }, 
    {
      "op": "where", 
      "name": "where363", 
      "inputs": [[247, 0, 0], [215, 0, 0], [199, 0, 0]]
    }, 
    {
      "op": "where", 
      "name": "where369", 
      "inputs": [[36, 1096, 0], [96, 0, 0], [248, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "lstm_l_1t3_h2h", 
      "attrs": {"num_hidden": "160"}, 
      "inputs": [[249, 0, 0], [98, 0, 0], [99, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus161", 
      "inputs": [[245, 0, 0], [250, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "lstm_l_1t3_slice", 
      "attrs": {"num_outputs": "4"}, 
      "inputs": [[251, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "lstm_l_1t3_o", 
      "attrs": {"act_type": "sigmoid"}, 
      "inputs": [[252, 3, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "lstm_l_1t3_f", 
      "attrs": {"act_type": "sigmoid"}, 
      "inputs": [[252, 1, 0]]
    }, 
    {
      "op": "ones_like", 
      "name": "ones_like163", 
      "inputs": [[213, 0, 0]]
    }, 
    {
      "op": "Dropout", 
      "name": "dropout159", 
      "attrs": {"p": "0.1"}, 
      "inputs": [[255, 0, 0]]
    }, 
    {
      "op": "where", 
      "name": "where364", 
      "inputs": [[256, 0, 0], [213, 0, 0], [208, 0, 0]]
    }, 
    {
      "op": "where", 
      "name": "where370", 
      "inputs": [[36, 1096, 0], [105, 0, 0], [257, 0, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "_mul611", 
      "inputs": [[254, 0, 0], [258, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "lstm_l_1t3_i", 
      "attrs": {"act_type": "sigmoid"}, 
      "inputs": [[252, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "lstm_l_1t3_c", 
      "attrs": {"act_type": "tanh"}, 
      "inputs": [[252, 2, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "_mul612", 
      "inputs": [[260, 0, 0], [261, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "lstm_l_1t3_state", 
      "inputs": [[259, 0, 0], [262, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation161", 
      "attrs": {"act_type": "tanh"}, 
      "inputs": [[263, 0, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "lstm_l_1t3_out", 
      "inputs": [[253, 0, 0], [264, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "lstm_l_1t3_out_plus_residual", 
      "inputs": [[265, 0, 0], [244, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "fullyconnected120", 
      "attrs": {"num_hidden": "1"}, 
      "inputs": [[266, 0, 0], [115, 0, 0], [116, 0, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "_mul619", 
      "inputs": [[267, 0, 0], [30, 0, 0]]
    }, 
    {
      "op": "where", 
      "name": "where375", 
      "inputs": [[36, 1096, 0], [65, 0, 0], [268, 0, 0]]
    }, 
    {
      "op": "where", 
      "name": "where376", 
      "inputs": [[15, 1096, 0], [10, 1096, 0], [269, 0, 0]]
    }, 
    {
      "op": "Concat", 
      "name": "concat91", 
      "attrs": {
        "dim": "1", 
        "num_args": "30"
      }, 
      "inputs": [
        [270, 0, 0], 
        [220, 0, 0], 
        [170, 0, 0], 
        [120, 0, 0], 
        [10, 1092, 0], 
        [10, 1091, 0], 
        [10, 1090, 0], 
        [10, 1089, 0], 
        [10, 1084, 0], 
        [10, 1083, 0], 
        [10, 1082, 0], 
        [10, 1077, 0], 
        [10, 1076, 0], 
        [10, 1075, 0], 
        [10, 1070, 0], 
        [10, 1069, 0], 
        [10, 1068, 0], 
        [10, 1067, 0], 
        [10, 1066, 0], 
        [10, 1041, 0], 
        [10, 1013, 0], 
        [10, 734, 0], 
        [10, 733, 0], 
        [10, 732, 0], 
        [10, 370, 0], 
        [10, 369, 0], 
        [10, 368, 0], 
        [10, 6, 0], 
        [10, 5, 0], 
        [10, 4, 0]
      ]
    }, 
    {
      "op": "broadcast_div", 
      "name": "broadcast_div43", 
      "inputs": [[271, 0, 0], [30, 0, 0]]
    }, 
    {
      "op": "Concat", 
      "name": "concat92", 
      "attrs": {
        "dim": "1", 
        "num_args": "3"
      }, 
      "inputs": [[39, 1097, 0], [32, 0, 0], [272, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "lstm_l_0t4_i2h", 
      "attrs": {"num_hidden": "160"}, 
      "inputs": [[273, 0, 0], [72, 0, 0], [73, 0, 0]]
    }, 
    {
      "op": "ones_like", 
      "name": "ones_like164", 
      "inputs": [[244, 0, 0]]
    }, 
    {
      "op": "Dropout", 
      "name": "dropout160", 
      "attrs": {"p": "0.1"}, 
      "inputs": [[275, 0, 0]]
    }, 
    {
      "op": "where", 
      "name": "where371", 
      "inputs": [[276, 0, 0], [244, 0, 0], [228, 0, 0]]
    }, 
    {
      "op": "where", 
      "name": "where377", 
      "inputs": [[36, 1097, 0], [75, 0, 0], [277, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "lstm_l_0t4_h2h", 
      "attrs": {"num_hidden": "160"}, 
      "inputs": [[278, 0, 0], [77, 0, 0], [78, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus164", 
      "inputs": [[274, 0, 0], [279, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "lstm_l_0t4_slice", 
      "attrs": {"num_outputs": "4"}, 
      "inputs": [[280, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "lstm_l_0t4_o", 
      "attrs": {"act_type": "sigmoid"}, 
      "inputs": [[281, 3, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "lstm_l_0t4_f", 
      "attrs": {"act_type": "sigmoid"}, 
      "inputs": [[281, 1, 0]]
    }, 
    {
      "op": "ones_like", 
      "name": "ones_like165", 
      "inputs": [[242, 0, 0]]
    }, 
    {
      "op": "Dropout", 
      "name": "dropout161", 
      "attrs": {"p": "0.1"}, 
      "inputs": [[284, 0, 0]]
    }, 
    {
      "op": "where", 
      "name": "where372", 
      "inputs": [[285, 0, 0], [242, 0, 0], [237, 0, 0]]
    }, 
    {
      "op": "where", 
      "name": "where378", 
      "inputs": [[36, 1097, 0], [84, 0, 0], [286, 0, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "_mul624", 
      "inputs": [[283, 0, 0], [287, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "lstm_l_0t4_i", 
      "attrs": {"act_type": "sigmoid"}, 
      "inputs": [[281, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "lstm_l_0t4_c", 
      "attrs": {"act_type": "tanh"}, 
      "inputs": [[281, 2, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "_mul625", 
      "inputs": [[289, 0, 0], [290, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "lstm_l_0t4_state", 
      "inputs": [[288, 0, 0], [291, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation164", 
      "attrs": {"act_type": "tanh"}, 
      "inputs": [[292, 0, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "lstm_l_0t4_out", 
      "inputs": [[282, 0, 0], [293, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "lstm_l_1t4_i2h", 
      "attrs": {"num_hidden": "160"}, 
      "inputs": [[294, 0, 0], [93, 0, 0], [94, 0, 0]]
    }, 
    {
      "op": "ones_like", 
      "name": "ones_like166", 
      "inputs": [[265, 0, 0]]
    }, 
    {
      "op": "Dropout", 
      "name": "dropout162", 
      "attrs": {"p": "0.1"}, 
      "inputs": [[296, 0, 0]]
    }, 
    {
      "op": "where", 
      "name": "where373", 
      "inputs": [[297, 0, 0], [265, 0, 0], [249, 0, 0]]
    }, 
    {
      "op": "where", 
      "name": "where379", 
      "inputs": [[36, 1097, 0], [96, 0, 0], [298, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "lstm_l_1t4_h2h", 
      "attrs": {"num_hidden": "160"}, 
      "inputs": [[299, 0, 0], [98, 0, 0], [99, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus165", 
      "inputs": [[295, 0, 0], [300, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "lstm_l_1t4_slice", 
      "attrs": {"num_outputs": "4"}, 
      "inputs": [[301, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "lstm_l_1t4_o", 
      "attrs": {"act_type": "sigmoid"}, 
      "inputs": [[302, 3, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "lstm_l_1t4_f", 
      "attrs": {"act_type": "sigmoid"}, 
      "inputs": [[302, 1, 0]]
    }, 
    {
      "op": "ones_like", 
      "name": "ones_like167", 
      "inputs": [[263, 0, 0]]
    }, 
    {
      "op": "Dropout", 
      "name": "dropout163", 
      "attrs": {"p": "0.1"}, 
      "inputs": [[305, 0, 0]]
    }, 
    {
      "op": "where", 
      "name": "where374", 
      "inputs": [[306, 0, 0], [263, 0, 0], [258, 0, 0]]
    }, 
    {
      "op": "where", 
      "name": "where380", 
      "inputs": [[36, 1097, 0], [105, 0, 0], [307, 0, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "_mul626", 
      "inputs": [[304, 0, 0], [308, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "lstm_l_1t4_i", 
      "attrs": {"act_type": "sigmoid"}, 
      "inputs": [[302, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "lstm_l_1t4_c", 
      "attrs": {"act_type": "tanh"}, 
      "inputs": [[302, 2, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "_mul627", 
      "inputs": [[310, 0, 0], [311, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "lstm_l_1t4_state", 
      "inputs": [[309, 0, 0], [312, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation165", 
      "attrs": {"act_type": "tanh"}, 
      "inputs": [[313, 0, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "lstm_l_1t4_out", 
      "inputs": [[303, 0, 0], [314, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "lstm_l_1t4_out_plus_residual", 
      "inputs": [[315, 0, 0], [294, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "fullyconnected123", 
      "attrs": {"num_hidden": "1"}, 
      "inputs": [[316, 0, 0], [115, 0, 0], [116, 0, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "_mul634", 
      "inputs": [[317, 0, 0], [30, 0, 0]]
    }, 
    {
      "op": "where", 
      "name": "where385", 
      "inputs": [[36, 1097, 0], [64, 0, 0], [318, 0, 0]]
    }, 
    {
      "op": "where", 
      "name": "where386", 
      "inputs": [[15, 1097, 0], [10, 1097, 0], [319, 0, 0]]
    }, 
    {
      "op": "Concat", 
      "name": "concat93", 
      "attrs": {
        "dim": "1", 
        "num_args": "30"
      }, 
      "inputs": [
        [320, 0, 0], 
        [270, 0, 0], 
        [220, 0, 0], 
        [170, 0, 0], 
        [120, 0, 0], 
        [10, 1092, 0], 
        [10, 1091, 0], 
        [10, 1090, 0], 
        [10, 1085, 0], 
        [10, 1084, 0], 
        [10, 1083, 0], 
        [10, 1078, 0], 
        [10, 1077, 0], 
        [10, 1076, 0], 
        [10, 1071, 0], 
        [10, 1070, 0], 
        [10, 1069, 0], 
        [10, 1068, 0], 
        [10, 1067, 0], 
        [10, 1042, 0], 
        [10, 1014, 0], 
        [10, 735, 0], 
        [10, 734, 0], 
        [10, 733, 0], 
        [10, 371, 0], 
        [10, 370, 0], 
        [10, 369, 0], 
        [10, 7, 0], 
        [10, 6, 0], 
        [10, 5, 0]
      ]
    }, 
    {
      "op": "broadcast_div", 
      "name": "broadcast_div44", 
      "inputs": [[321, 0, 0], [30, 0, 0]]
    }, 
    {
      "op": "Concat", 
      "name": "concat94", 
      "attrs": {
        "dim": "1", 
        "num_args": "3"
      }, 
      "inputs": [[39, 1098, 0], [32, 0, 0], [322, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "lstm_l_0t5_i2h", 
      "attrs": {"num_hidden": "160"}, 
      "inputs": [[323, 0, 0], [72, 0, 0], [73, 0, 0]]
    }, 
    {
      "op": "ones_like", 
      "name": "ones_like168", 
      "inputs": [[294, 0, 0]]
    }, 
    {
      "op": "Dropout", 
      "name": "dropout164", 
      "attrs": {"p": "0.1"}, 
      "inputs": [[325, 0, 0]]
    }, 
    {
      "op": "where", 
      "name": "where381", 
      "inputs": [[326, 0, 0], [294, 0, 0], [278, 0, 0]]
    }, 
    {
      "op": "where", 
      "name": "where387", 
      "inputs": [[36, 1098, 0], [75, 0, 0], [327, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "lstm_l_0t5_h2h", 
      "attrs": {"num_hidden": "160"}, 
      "inputs": [[328, 0, 0], [77, 0, 0], [78, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus168", 
      "inputs": [[324, 0, 0], [329, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "lstm_l_0t5_slice", 
      "attrs": {"num_outputs": "4"}, 
      "inputs": [[330, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "lstm_l_0t5_o", 
      "attrs": {"act_type": "sigmoid"}, 
      "inputs": [[331, 3, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "lstm_l_0t5_f", 
      "attrs": {"act_type": "sigmoid"}, 
      "inputs": [[331, 1, 0]]
    }, 
    {
      "op": "ones_like", 
      "name": "ones_like169", 
      "inputs": [[292, 0, 0]]
    }, 
    {
      "op": "Dropout", 
      "name": "dropout165", 
      "attrs": {"p": "0.1"}, 
      "inputs": [[334, 0, 0]]
    }, 
    {
      "op": "where", 
      "name": "where382", 
      "inputs": [[335, 0, 0], [292, 0, 0], [287, 0, 0]]
    }, 
    {
      "op": "where", 
      "name": "where388", 
      "inputs": [[36, 1098, 0], [84, 0, 0], [336, 0, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "_mul639", 
      "inputs": [[333, 0, 0], [337, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "lstm_l_0t5_i", 
      "attrs": {"act_type": "sigmoid"}, 
      "inputs": [[331, 0, 0]]
    }, 
    {
